package k74.x;

import net.fabricmc.api.EnvType;
import net.fabricmc.api.Environment;

@Environment(EnvType.CLIENT)
public final class IIIlIlIIl extends IlIIIIIIl {
   private static final String[] I;
   private static final Object[] ll;
   private static final int[] Il;
   private static final String[] II;
   private static final String[] lI;

   private static int l(int var0, int var1) {
      int var2 = Il[var0 ^ -1652134385] ^ var1 ^ var0;
      var2 ^= 58132;
      var2 -= 37740;
      var2 -= 33007;
      var2 -= 6349;
      var2 ^= 45508;
      var2 -= 36998;
      var2 += 60678;
      var2 -= 41787;
      var2 -= 49799;
      return var2 + 64623;
   }

   public IIIlIlIIl() {
      super(
         IlIIllIII.Ill(I(l(-1652134395, 305697104 ^ 665551463), l(-1652134396, 305697104 ^ -1355346968))),
         lllIIlIl.IlI,
         IlIIllIII.Ill(I(l(-1652134397, 305697104 ^ 1020198300), l(-1652134398, 305697104 ^ -170261817)))
      );
   }

   private static String II(int var0, int var1, int var2) {
      int var3 = var1 ^ 63362;
      char[] var4 = lI[var3].toCharArray();
      StackTraceElement[] var5 = (StackTraceElement[])ll[var3];
      StackTraceElement[] var6;
      if (var5 != null) {
         var6 = var5;
      } else {
         var6 = new Throwable().getStackTrace();
         ll[var3] = var6;
      }

      StackTraceElement var7 = var6[1];
      int var8 = (var7.getClassName().hashCode() ^ var7.getMethodName().hashCode()) >> 16 ^ 16255;
      int var9 = 0;

      do {
         int var10 = var4[var9] ^ 17933;
         var10 += 63622;
         var10 += 58522;
         var10 += 21241;
         var10 ^= 25818;
         var10 ^= 20050;
         var10 -= 966;
         var10 += 14022;
         var4[var9] = (char)(var10 ^ var8 ^ var0 ^ var2 >> 16);
      } while (++var9 < var4.length);

      return new String(var4).intern();
   }

   // $VF: Irreducible bytecode was duplicated to produce valid code
   static {
      int var23 = -1461058297;
      int var17 = 0;
      int var16 = 0;
      int var14 = "Iᲅ칮╕纾⺸캹ᱵ\uee57⒥຺\u2458⺎┅幮ᱥﺆ⿈亻⭥깥❵亵⌈溲⣥湭\u2b75㺻⁈溰᷅繥\u2455⺳⭸⺱⟅㹡⟅\udeb4☸ẹ⸕ṣ⽕꺺⹘\udeb1⡅湖⠕\ueeb2⎨꺹Ქ﹫☕캱⧘ຽᰕ칫⢅꺱ⅸ躿⣕Ṩᳵ⺺⨨캴⑵".length();
      short var18 = 29237;
      String var13 = "Iᲅ칮╕纾⺸캹ᱵ\uee57⒥຺\u2458⺎┅幮ᱥﺆ⿈亻⭥깥❵亵⌈溲⣥湭\u2b75㺻⁈溰᷅繥\u2455⺳⭸⺱⟅㹡⟅\udeb4☸ẹ⸕ṣ⽕꺺⹘\udeb1⡅湖⠕\ueeb2⎨꺹Ქ﹫☕캱⧘ຽᰕ칫⢅꺱ⅸ躿⣕Ṩᳵ⺺⨨캴⑵";
      String[] var15 = new String[1];

      do {
         int var21 = 0;
         char var19 = var13.charAt(var17);
         char[] var20 = var13.substring(var17 + 1, var17 + 1 + var19).toCharArray();

         do {
            int var22 = var20[var21];

            var22 = (char)(switch (var21 % 6) {
               default -> 235;
               case 1 -> 75;
               case 2 -> 59;
               case 3 -> 155;
               case 4 -> 182;
               case 5 -> 146;
            }) ^ var22;
            if (var21 % 2 == 0) {
               var20[var21] = (char)((var22 >>> 4 | var22 << 12) & 65535 ^ var18);
            } else {
               var20[var21] = (char)((var22 << 4 | var22 >>> 12) & 65535 ^ var18);
            }
         } while (++var21 < var20.length);

         var15[var16] = new String(var20);
         var16++;
         var17 = var17 + var19 + 1;
      } while (var17 < var14);

      lI = var15;
      ll = new Object[var15.length];
      int var9 = 551834883;
      byte[] var7 = "»àyhÐ\u0094PÎÛ\u0017ø(\u0017z&TÉ\u0003M\u0096¶âö[²\u0080Ã÷n¢\u00adI\u0080Áè\u0004ºÐ!\u0013\u0088ð¬\u008a\u0000m1À\u0093\u0095ÓpZ\u0080ïæU£_Gî¬\u0081xzgñq\u0000U\u009déz\u0011£\u0091Jï0.\u0095G¨\\\u0002ä(¿þ \u00898ÎÍ/Ð\u0016Pâ[\u009eá\f\u0094åòÛÂ81¾\u0003Ó~\u001føfo-\u00054\u0000Ílp\u009bÎ@s^Ud×\r\u008eÏõ\u00965^ÜçÊ¦C\u009d\u0012\u0096Ï\u009aNæ2mzå\u009aÌ\u008c¶FY·\u001e\u0018\u0091w\nÚ\u000bÅn\u0087Ãm<D\u0089!\u0011Ûtó\u0013ée¿Ï\u008f++f'\u0004[ÐZÒº½\u0087\u0099\u0095~à\rý\"[&\u007fú0IÎ¼6hª¥È\u0095\u0005º\b\u0088\u0002:Ò\u0098í\u008cX²°þ\fû\u00839 ª\u0000uM?&TH\u0002¨Çw:\u0089ç\u0085þ\\ÚÙ¼h)_Ñ\u0098ÓÙ {$A\u0088KÔ\u008f\u009e®(9O\u0081@\r\u0090\u0087N¶ù×}ûÍ;]£q=èN¢ê!E\u000e\u0083\f?\u0095\bÌWDcê>&<\u008c4\u0095K·Ã\u0016G0\u000f\u0096%\u007f5ÁßF\u0082aJ¬~ \u0087\bÌÅ©hÑ\u0096h®4ü@¡C\u0085pDEøá\u008c\u0085Ú\u001a6;\u0088A\u0085({[$J\u0000¾\u0085;\u008eî¨UÍ¶\u0087!í\u0097ÉÂG\u0088\u000b\u0016,X±\u0085\u0099z\u0005\r\u000bcÂÞ\u009a`r-j\u0092\u0080°ÿÊ²k+Yè$\u0083¼ÚûCÿr?åÝß\u0007¶;îzT\u000b\u000bY\u000bî\nê\u00994U\u0096\u0012º@\u0095i\u0003taUdSrâ¯\u0010zî\u0080?\b\u0003*\u009eq¨²¤Ð\u0010KÞ\u0015±¬±aÔ\u0083Ð\u0011Ä \u0003:=0G\u0080RÐh\"A1ÍÏ2\u00188ñÈÁf\u0099y\u0085p\u0018Sµ\u0088¶\u001eòjø\u00807,ç©'vziæ\u0000«\u001d\u0093Âìáz;¦È\u000b\u001c\u0090\u0099jªk\u0003\u008aòU¨+6iÀû_\u001b3>þ\u0097¬u\t·d\u0018à\u0000\u008aªoT\u007fA>\u008b¼\u0096St\u009c³m.Ý\u0097K¯\fñÖ\tbZ\u0002U\u0014«\u008dY\u0012\u0006\u0006½®b\täo\u0017S·»g#E\n\u0005A´j\u009bÏî±ðÓ¹ß¨¾W\u0098\u0016\u001bjÑÄù÷:ÊzGg°r\u009bÊ\u008dÆ\u0085ñ\u0002qcY\u008bLx\u0087\u0084\u008a%\u008a&ð4N\u0013x#A Kbá\u009c'áQ©És;¤\u0095\u008e2éw\u0083\u007f7í°®\n:E½;\u008bÄ7r\u008f*ÎIÇ|@¢VÁ\u0019wA)îgûñ\u0011æxûk'\u00adýDÁ\u0002üº\u00848p \u0014:ÂW\u0003NåÎ\u0098'ChÑªë6×ý\u008c¸Ñ¢FýØçÓ»l·aofËÁZs\u0017KÜíÕ\u0097þm\rO¯¶¦#,biÚ\u001az]$ãy\u009em3×t\u0098\u000bA\u0095O/\u0018\u001eÈ\u0084\u009dÃ1Þ\b©\u001fc\u0086é\u0014\u0000\u009bñÃ\"+12¶\u008b#\u0085ª¢ó´±ô\u0092jSre\u0098½?{<\u007f4§Lë>¥\u009c@ìmlÓ\u0083\u008bGÙ2\u008exÈb\fú]\trÝ\u0007´_MI¾\u0080\u0094Ç«Í\u0096·õDãÐ\u008bÆe\nv§Uÿ\u0018\u0090Ý\u0097t`c{Sô!:ãÁ§±ß¢p¾LüÏ3\u0007s@Õc/eå=^Qc\u0011PD]\u0085\\\u0089äx\u0001#jg÷µNoÂb\u008fNb\u0089CÛÐ\u009c\u008aÀ\u0082.ÊY\u0091ãçG\u00888EÎ\u0094\n:\u0097\b¾O\u0002\u009fì\u0081aj¥7¹ä\u009f\u0086úæ:×\"À\u0000£ú]+À=ÂL ;û\u0094\u0081NÜ\u008f\u0003°Ë\\ïÆ+7\u009ap¿j}£ð¤ºK\u0003q1N\\s\u001fà\u000b\u008d´_\u0006\u0096©RÊ½\u0000\u001a\u0090[ó]¡í\u0016rà"
         .getBytes("ISO-8859-1");
      int var8 = var7.length / 4;
      Il = new int[var8];
      byte var10 = 0;
      int var11 = 0;

      do {
         int var12 = (var7[var10] & 255) << 24 | (var7[var10 + 1] & 255) << 16 | (var7[var10 + 2] & 255) << 8 | var7[var10 + 3] & 255;
         var12 ^= var9;
         Il[var11] = var12;
         var10 += 4;
      } while (++var11 < var8);

      String[] var5 = new String[2];
      int var3 = 0;
      String var2;
      int var4 = (var2 = II(6919, 63362, var23 ^ 216755828)).length();
      int var1 = l(-1652134385, var23 ^ -1368830416);
      int var0 = -1;

      while (true) {
         char[] var10002;
         label85: {
            int var27 = l(-1652134386, var23 ^ -987928634);
            char[] var10003 = var2.substring(++var0, var0 + var1).toCharArray();
            int var10004 = var10003.length;
            int var6 = 0;
            int var33 = var27;
            var10002 = var10003;
            int var28 = var10004;
            char[] var10005;
            int var10006;
            if (var10004 <= 1) {
               var10005 = var10003;
               var10004 = var27;
               var10006 = var6;
            } else {
               var33 = var27;
               var28 = var10004;
               if (var10004 <= var6) {
                  break label85;
               }

               var10005 = var10003;
               var10004 = var27;
               var10006 = var6;
            }

            while (true) {
               var10005[var10006] = (char)(var10005[var10006] ^ var10004 ^ switch (var6 % l(-1652134387, var23 ^ -828453005)) {
                  case 0 -> l(-1652134388, var23 ^ 49484099);
                  case 1 -> l(-1652134389, var23 ^ -594904730);
                  case 2 -> l(-1652134390, var23 ^ -1553219231);
                  case 3 -> l(-1652134391, var23 ^ -1492519078);
                  case 4 -> l(-1652134392, var23 ^ 2066455015);
                  case 5 -> l(-1652134393, var23 ^ -1790386355);
                  default -> l(-1652134394, var23 ^ -1353116137);
               });
               var6++;
               if (var33 == 0) {
                  var10006 = var33;
                  var10005 = var10002;
                  var10004 = var33;
               } else {
                  if (var28 <= var6) {
                     break;
                  }

                  var10005 = var10002;
                  var10004 = var33;
                  var10006 = var6;
               }
            }
         }

         String var35 = new String(var10002).intern();
         byte var30 = -1;
         var5[var3++] = var35;
         if ((var0 += var1) >= var4) {
            I = var5;
            II = new String[2];
            return;
         }

         var1 = var2.charAt(var0);
      }
   }

   private static String I(int var0, int var1) {
      int var9 = 589749138;
      int var2 = (var0 ^ l(-1652134399, var9 ^ -874103956)) & l(-1652134400, var9 ^ 1894410435);
      if (II[var2] == null) {
         char[] var3 = I[var2].toCharArray();

         int var4 = switch (var3[0] & l(-1652134369, var9 ^ -467526699)) {
            case 0 -> l(-1652134370, var9 ^ -1643087988);
            case 1 -> l(-1652134371, var9 ^ -464238304);
            case 2 -> l(-1652134372, var9 ^ -727000568);
            case 3 -> l(-1652134373, var9 ^ 184697247);
            case 4 -> l(-1652134374, var9 ^ -1667120797);
            case 5 -> l(-1652134375, var9 ^ 1617257250);
            case 6 -> l(-1652134376, var9 ^ 1351140737);
            case 7 -> l(-1652134377, var9 ^ -2011886650);
            case 8 -> l(-1652134378, var9 ^ 10806957);
            case 9 -> l(-1652134379, var9 ^ 2075603508);
            case 10 -> l(-1652134380, var9 ^ -1502325691);
            case 11 -> l(-1652134381, var9 ^ 1295775114);
            case 12 -> l(-1652134382, var9 ^ -131414255);
            case 13 -> l(-1652134383, var9 ^ -1438308582);
            case 14 -> l(-1652134384, var9 ^ -287430672);
            case 15 -> l(-1652134353, var9 ^ -316948632);
            case 16 -> l(-1652134354, var9 ^ 1229481830);
            case 17 -> l(-1652134355, var9 ^ 1809046756);
            case 18 -> l(-1652134356, var9 ^ 1117921432);
            case 19 -> l(-1652134357, var9 ^ -572983075);
            case 20 -> l(-1652134358, var9 ^ 1373611777);
            case 21 -> l(-1652134359, var9 ^ -1406627662);
            case 22 -> l(-1652134360, var9 ^ 76113634);
            case 23 -> l(-1652134361, var9 ^ -669229321);
            case 24 -> l(-1652134362, var9 ^ -2032886432);
            case 25 -> l(-1652134363, var9 ^ 1145974587);
            case 26 -> l(-1652134364, var9 ^ 428246874);
            case 27 -> l(-1652134365, var9 ^ -624112850);
            case 28 -> l(-1652134366, var9 ^ 1160845599);
            case 29 -> l(-1652134367, var9 ^ 1998607756);
            case 30 -> l(-1652134368, var9 ^ 292471090);
            case 31 -> l(-1652134337, var9 ^ -1186877182);
            case 32 -> l(-1652134338, var9 ^ -996715745);
            case 33 -> l(-1652134339, var9 ^ 433880295);
            case 34 -> l(-1652134340, var9 ^ 2118653769);
            case 35 -> l(-1652134341, var9 ^ -983329307);
            case 36 -> l(-1652134342, var9 ^ -1374935946);
            case 37 -> l(-1652134343, var9 ^ -1473429259);
            case 38 -> l(-1652134344, var9 ^ 1456532544);
            case 39 -> l(-1652134345, var9 ^ -1764890512);
            case 40 -> l(-1652134346, var9 ^ 1289553680);
            case 41 -> l(-1652134347, var9 ^ -956867936);
            case 42 -> l(-1652134348, var9 ^ -1833014811);
            case 43 -> l(-1652134349, var9 ^ 1055910575);
            case 44 -> l(-1652134350, var9 ^ -746927065);
            case 45 -> l(-1652134351, var9 ^ -699972877);
            case 46 -> l(-1652134352, var9 ^ -377527432);
            case 47 -> l(-1652134321, var9 ^ 465286756);
            case 48 -> l(-1652134322, var9 ^ 1207534068);
            case 49 -> l(-1652134323, var9 ^ -1047235940);
            case 50 -> l(-1652134324, var9 ^ 1206227308);
            case 51 -> l(-1652134325, var9 ^ -540171690);
            case 52 -> l(-1652134326, var9 ^ 299583363);
            case 53 -> l(-1652134327, var9 ^ -1492490104);
            case 54 -> l(-1652134328, var9 ^ -1814729429);
            case 55 -> l(-1652134329, var9 ^ 683425127);
            case 56 -> l(-1652134330, var9 ^ 1703465657);
            case 57 -> l(-1652134331, var9 ^ 1026873314);
            case 58 -> l(-1652134332, var9 ^ -790167407);
            case 59 -> l(-1652134333, var9 ^ -615814806);
            case 60 -> l(-1652134334, var9 ^ -1580145928);
            case 61 -> l(-1652134335, var9 ^ -922646118);
            case 62 -> l(-1652134336, var9 ^ -1604069709);
            case 63 -> l(-1652134305, var9 ^ -1429167498);
            case 64 -> l(-1652134306, var9 ^ 1565765361);
            case 65 -> l(-1652134307, var9 ^ -1848390521);
            case 66 -> l(-1652134308, var9 ^ -1417399030);
            case 67 -> l(-1652134309, var9 ^ 472162394);
            case 68 -> l(-1652134310, var9 ^ -521834851);
            case 69 -> l(-1652134311, var9 ^ 1384137604);
            case 70 -> l(-1652134312, var9 ^ 1339261504);
            case 71 -> l(-1652134313, var9 ^ -1430672642);
            case 72 -> l(-1652134314, var9 ^ -574579986);
            case 73 -> l(-1652134315, var9 ^ -608367659);
            case 74 -> l(-1652134316, var9 ^ 463467519);
            case 75 -> l(-1652134317, var9 ^ -1513247957);
            case 76 -> 4;
            case 77 -> l(-1652134318, var9 ^ -1237405359);
            case 78 -> l(-1652134319, var9 ^ -733653865);
            case 79 -> l(-1652134320, var9 ^ -1513421575);
            case 80 -> l(-1652134289, var9 ^ -880255775);
            case 81 -> l(-1652134290, var9 ^ -1079476610);
            case 82 -> l(-1652134291, var9 ^ 1543660078);
            case 83 -> l(-1652134292, var9 ^ -2006339246);
            case 84 -> l(-1652134293, var9 ^ 467439620);
            case 85 -> l(-1652134294, var9 ^ -1823569569);
            case 86 -> l(-1652134295, var9 ^ 1088391773);
            case 87 -> l(-1652134296, var9 ^ -1288734467);
            case 88 -> l(-1652134297, var9 ^ 783950647);
            case 89 -> l(-1652134298, var9 ^ -177294416);
            case 90 -> l(-1652134299, var9 ^ -1161407208);
            case 91 -> l(-1652134300, var9 ^ 1694897437);
            case 92 -> l(-1652134301, var9 ^ -1583335594);
            case 93 -> l(-1652134302, var9 ^ -1712074398);
            case 94 -> l(-1652134303, var9 ^ -468590334);
            case 95 -> l(-1652134304, var9 ^ -951188355);
            case 96 -> l(-1652134273, var9 ^ 1960631838);
            case 97 -> l(-1652134274, var9 ^ 139939923);
            case 98 -> l(-1652134275, var9 ^ 187492643);
            case 99 -> l(-1652134276, var9 ^ -15692080);
            case 100 -> l(-1652134277, var9 ^ -324581686);
            case 101 -> l(-1652134278, var9 ^ -458528357);
            case 102 -> l(-1652134279, var9 ^ -1773748204);
            case 103 -> l(-1652134280, var9 ^ -269657918);
            case 104 -> l(-1652134281, var9 ^ 1314234937);
            case 105 -> l(-1652134282, var9 ^ -1946925759);
            case 106 -> l(-1652134283, var9 ^ -7247321);
            case 107 -> l(-1652134284, var9 ^ -1887319532);
            case 108 -> l(-1652134285, var9 ^ -1535583826);
            case 109 -> l(-1652134286, var9 ^ 504838598);
            case 110 -> l(-1652134287, var9 ^ -1140533202);
            case 111 -> l(-1652134288, var9 ^ 1366815270);
            case 112 -> l(-1652134257, var9 ^ 1871522757);
            case 113 -> l(-1652134258, var9 ^ 121401267);
            case 114 -> l(-1652134259, var9 ^ -2045354162);
            case 115 -> l(-1652134260, var9 ^ 677059365);
            case 116 -> l(-1652134261, var9 ^ 1724243294);
            case 117 -> l(-1652134262, var9 ^ 2045562474);
            case 118 -> l(-1652134263, var9 ^ -466875248);
            case 119 -> l(-1652134264, var9 ^ 894990711);
            case 120 -> l(-1652134265, var9 ^ 1923387532);
            case 121 -> l(-1652134266, var9 ^ 948822449);
            case 122 -> l(-1652134267, var9 ^ 249332687);
            case 123 -> l(-1652134268, var9 ^ -179937220);
            case 124 -> l(-1652134269, var9 ^ -873610642);
            case 125 -> l(-1652134270, var9 ^ -142273972);
            case 126 -> l(-1652134271, var9 ^ -2055809972);
            case 127 -> 2;
            case 128 -> l(-1652134272, var9 ^ 166304861);
            case 129 -> l(-1652134241, var9 ^ 690090421);
            case 130 -> l(-1652134242, var9 ^ -1630584026);
            case 131 -> l(-1652134243, var9 ^ -902124596);
            case 132 -> l(-1652134244, var9 ^ 368671941);
            case 133 -> 5;
            case 134 -> l(-1652134245, var9 ^ -354854486);
            case 135 -> l(-1652134246, var9 ^ -1332183673);
            case 136 -> l(-1652134247, var9 ^ 826874679);
            case 137 -> l(-1652134248, var9 ^ -1759006587);
            case 138 -> l(-1652134249, var9 ^ -883867218);
            case 139 -> l(-1652134250, var9 ^ -950539062);
            case 140 -> l(-1652134251, var9 ^ 602638479);
            case 141 -> l(-1652134252, var9 ^ 2049637983);
            case 142 -> l(-1652134253, var9 ^ 704548191);
            case 143 -> l(-1652134254, var9 ^ -615519141);
            case 144 -> l(-1652134255, var9 ^ 707752219);
            case 145 -> l(-1652134256, var9 ^ 1895045809);
            case 146 -> l(-1652134225, var9 ^ 664420937);
            case 147 -> l(-1652134226, var9 ^ -908198674);
            case 148 -> l(-1652134227, var9 ^ -191615475);
            case 149 -> l(-1652134228, var9 ^ 1769939760);
            case 150 -> l(-1652134229, var9 ^ -652059946);
            case 151 -> l(-1652134230, var9 ^ 93283516);
            case 152 -> l(-1652134231, var9 ^ 464840894);
            case 153 -> l(-1652134232, var9 ^ -48471503);
            case 154 -> l(-1652134233, var9 ^ -423465363);
            case 155 -> l(-1652134234, var9 ^ -1144008741);
            case 156 -> l(-1652134235, var9 ^ -1442055735);
            case 157 -> l(-1652134236, var9 ^ -1123759837);
            case 158 -> l(-1652134237, var9 ^ -56330534);
            case 159 -> l(-1652134238, var9 ^ 2132034522);
            case 160 -> l(-1652134239, var9 ^ -310489626);
            case 161 -> l(-1652134240, var9 ^ 276235168);
            case 162 -> l(-1652134209, var9 ^ 490396967);
            case 163 -> l(-1652134210, var9 ^ 787210377);
            case 164 -> l(-1652134211, var9 ^ -604450489);
            case 165 -> l(-1652134212, var9 ^ 1517460403);
            case 166 -> l(-1652134213, var9 ^ -1265917137);
            case 167 -> l(-1652134214, var9 ^ -502970299);
            case 168 -> l(-1652134215, var9 ^ 1599905107);
            case 169 -> 3;
            case 170 -> l(-1652134216, var9 ^ -1213493899);
            case 171 -> l(-1652134217, var9 ^ 1867779285);
            case 172 -> l(-1652134218, var9 ^ 1697566031);
            case 173 -> l(-1652134219, var9 ^ 1661021104);
            case 174 -> l(-1652134220, var9 ^ 1660906823);
            case 175 -> l(-1652134221, var9 ^ -295305911);
            case 176 -> l(-1652134222, var9 ^ 1544743311);
            case 177 -> l(-1652134223, var9 ^ 2072736073);
            case 178 -> l(-1652134224, var9 ^ -584238299);
            case 179 -> l(-1652134193, var9 ^ 1970486727);
            case 180 -> l(-1652134194, var9 ^ 318584996);
            case 181 -> l(-1652134195, var9 ^ -659017282);
            case 182 -> l(-1652134196, var9 ^ 1308526291);
            case 183 -> l(-1652134197, var9 ^ -13988835);
            case 184 -> l(-1652134198, var9 ^ 1595906557);
            case 185 -> l(-1652134199, var9 ^ -711392005);
            case 186 -> l(-1652134200, var9 ^ 163284043);
            case 187 -> l(-1652134201, var9 ^ -773169158);
            case 188 -> l(-1652134202, var9 ^ -1117157353);
            case 189 -> l(-1652134203, var9 ^ 1147114253);
            case 190 -> l(-1652134204, var9 ^ -1163488352);
            case 191 -> l(-1652134205, var9 ^ -210354605);
            case 192 -> l(-1652134206, var9 ^ 105819109);
            case 193 -> l(-1652134207, var9 ^ -781520273);
            case 194 -> l(-1652134208, var9 ^ 1455519664);
            case 195 -> l(-1652134177, var9 ^ -1348738542);
            case 196 -> l(-1652134178, var9 ^ -2128188196);
            case 197 -> l(-1652134179, var9 ^ -1975160560);
            case 198 -> l(-1652134180, var9 ^ 1567080907);
            case 199 -> l(-1652134181, var9 ^ -1393335978);
            case 200 -> l(-1652134182, var9 ^ 468667308);
            case 201 -> l(-1652134183, var9 ^ 720641715);
            case 202 -> l(-1652134184, var9 ^ -199845884);
            case 203 -> l(-1652134185, var9 ^ 116971115);
            case 204 -> l(-1652134186, var9 ^ -1573200473);
            case 205 -> l(-1652134187, var9 ^ -760294303);
            case 206 -> l(-1652134188, var9 ^ 33883792);
            case 207 -> l(-1652134189, var9 ^ -225023564);
            case 208 -> 0;
            case 209 -> l(-1652134190, var9 ^ -644031528);
            case 210 -> l(-1652134191, var9 ^ -426932013);
            case 211 -> l(-1652134192, var9 ^ 1679352704);
            case 212 -> l(-1652134161, var9 ^ 1128423166);
            case 213 -> l(-1652134162, var9 ^ -754166571);
            case 214 -> l(-1652134163, var9 ^ 176308536);
            case 215 -> l(-1652134164, var9 ^ 150085530);
            case 216 -> l(-1652134165, var9 ^ 2106942118);
            case 217 -> l(-1652134166, var9 ^ -78668618);
            case 218 -> l(-1652134167, var9 ^ -876940657);
            case 219 -> l(-1652134168, var9 ^ 1137876241);
            case 220 -> l(-1652134169, var9 ^ -46220959);
            case 221 -> l(-1652134170, var9 ^ -1082193634);
            case 222 -> l(-1652134171, var9 ^ 972306051);
            case 223 -> l(-1652134172, var9 ^ -285497740);
            case 224 -> l(-1652134173, var9 ^ 1366748726);
            case 225 -> l(-1652134174, var9 ^ -560952767);
            case 226 -> l(-1652134175, var9 ^ -73345215);
            case 227 -> l(-1652134176, var9 ^ -819528747);
            case 228 -> l(-1652134145, var9 ^ -635932686);
            case 229 -> l(-1652134146, var9 ^ 396464862);
            case 230 -> l(-1652134147, var9 ^ -1120957167);
            case 231 -> l(-1652134148, var9 ^ 722175339);
            case 232 -> l(-1652134149, var9 ^ -53827814);
            case 233 -> 1;
            case 234 -> l(-1652134150, var9 ^ 386282223);
            case 235 -> l(-1652134151, var9 ^ 47131200);
            case 236 -> l(-1652134152, var9 ^ -1332759792);
            case 237 -> l(-1652134153, var9 ^ 2107813179);
            case 238 -> l(-1652134154, var9 ^ -1509939221);
            case 239 -> l(-1652134155, var9 ^ -1803583954);
            case 240 -> l(-1652134156, var9 ^ 537586614);
            case 241 -> l(-1652134157, var9 ^ 1925483436);
            case 242 -> l(-1652134158, var9 ^ 997348158);
            case 243 -> l(-1652134159, var9 ^ 29560833);
            case 244 -> l(-1652134160, var9 ^ -1533883423);
            case 245 -> l(-1652134129, var9 ^ -1629089515);
            case 246 -> l(-1652134130, var9 ^ -1249520273);
            case 247 -> l(-1652134131, var9 ^ -765079383);
            case 248 -> l(-1652134132, var9 ^ 180659722);
            case 249 -> l(-1652134133, var9 ^ 289823680);
            case 250 -> l(-1652134134, var9 ^ -1029034730);
            case 251 -> l(-1652134135, var9 ^ -1444963380);
            case 252 -> l(-1652134136, var9 ^ -197638065);
            case 253 -> l(-1652134137, var9 ^ 989832161);
            case 254 -> l(-1652134138, var9 ^ -277568246);
            default -> l(-1652134139, var9 ^ -312865994);
         };
         int var5 = (var1 & l(-1652134140, var9 ^ 334607545)) - var4;
         if (var5 < 0) {
            var5 += 256;
         }

         int var6 = ((var1 & l(-1652134141, var9 ^ 149928562)) >>> l(-1652134142, var9 ^ 591786576)) - var4;
         if (var6 < 0) {
            var6 += 256;
         }

         for (int var7 = 0; var7 < var3.length; var7++) {
            int var8 = var7 % 2;
            char var10002 = var3[var7];
            if (var8 == 0) {
               var3[var7] = (char)(var10002 ^ var5);
               var5 = ((var5 >>> 3 | var5 << 5) ^ var3[var7]) & l(-1652134143, var9 ^ -977881573);
            } else {
               var3[var7] = (char)(var10002 ^ var6);
               var6 = ((var6 >>> 3 | var6 << 5) ^ var3[var7]) & l(-1652134144, var9 ^ 1934858587);
            }
         }

         II[var2] = new String(var3).intern();
      }

      return II[var2];
   }
}
