package k74.x;

import com.google.gson.JsonObject;
import net.fabricmc.api.EnvType;
import net.fabricmc.api.Environment;
import net.minecraft.class_310;

@Environment(EnvType.CLIENT)
public final class lIlIII extends IlIIIIIIl {
   private static final int[] Il;
   private static final Object[] ll;
   private static final String[] I;
   private static final String[] lI;
   private static final String[] II;

   private static int l(int var0, int var1) {
      int var2 = Il[var0 ^ 878751859] ^ var1 ^ var0;
      var2 ^= 10715;
      var2 -= 1668;
      var2 -= 14486;
      var2 -= 33785;
      var2 ^= 25614;
      return var2 ^ 26174;
   }

   @Override
   public void IllIIII(JsonObject var1) {
   }

   private static String II(int var0, int var1) {
      int var3 = var0 ^ 1759104658;
      char[] var4 = lI[var3].toCharArray();
      StackTraceElement[] var2 = (StackTraceElement[])ll[var3];
      StackTraceElement[] var5;
      if (var2 != null) {
         var5 = var2;
      } else {
         var5 = new Throwable().getStackTrace();
         ll[var3] = var5;
      }

      StackTraceElement var6 = var5[1];
      int var7 = (var6.getClassName().hashCode() ^ var6.getMethodName().hashCode()) >> 16 ^ 843868989;
      int var8 = 0;

      do {
         var4[var8] = (char)(var4[var8] ^ switch (var8 & 31) {
            default -> 142;
            case 1 -> 220;
            case 2 -> 181;
            case 3 -> 201;
            case 4 -> 120;
            case 5 -> 248;
            case 6 -> 130;
            case 7 -> 43;
            case 8 -> 192;
            case 9 -> 21;
            case 10 -> 253;
            case 11 -> 133;
            case 12 -> 50;
            case 13 -> 181;
            case 14 -> 255;
            case 15 -> 18;
            case 16 -> 118;
            case 17 -> 184;
            case 18 -> 243;
            case 19 -> 179;
            case 20 -> 99;
            case 21 -> 111;
            case 22 -> 111;
            case 23 -> 78;
            case 24 -> 229;
            case 25 -> 119;
            case 26 -> 128;
            case 27 -> 59;
            case 28 -> 174;
            case 29 -> 135;
            case 30 -> 5;
            case 31 -> 39;
         } ^ var1 >> 16 ^ var7);
      } while (++var8 < var4.length);

      return new String(var4).intern();
   }

   // $VF: Irreducible bytecode was duplicated to produce valid code
   static {
      int var23 = -1751378921;
      int var10001 = "y휝㝆힕坐퀝睜핕\uf741혵띕턍흓톥靈킥띘큭坝퇅靊킵흌튕ᝈ햽㝉픍址풥\uf745퓝\uf747ퟅ\uf744톭\u175c퓅흅튥㝆톍\uf75a톽\uf74a팍坈\ud7fd㝈폝㝐통\uf74f핅靜펕띏휥坕픅靂펕띏틭坏틅\uf757튍띊퇝㝉헭흟흭睚풭坐퉵흋퀕㝎턍坂툭ᝑ튅靂퇥\u1759틍띙퀭靗폭ᝉ혅띔큥靋확흉퍥띐톽ᝍ흵㝏튵坑텍\uf75b홅㝁탽㝄틽\uf74e훽흘훕흊통"
         .length();
      int var16 = 0;
      int var17 = 0;
      int var14 = var10001;
      String[] var26 = new String[1];
      short var18 = 28883;
      String[] var15 = var26;
      String var13 = "y휝㝆힕坐퀝睜핕\uf741혵띕턍흓톥靈킥띘큭坝퇅靊킵흌튕ᝈ햽㝉픍址풥\uf745퓝\uf747ퟅ\uf744톭\u175c퓅흅튥㝆톍\uf75a톽\uf74a팍坈\ud7fd㝈폝㝐통\uf74f핅靜펕띏휥坕픅靂펕띏틭坏틅\uf757튍띊퇝㝉헭흟흭睚풭坐퉵흋퀕㝎턍坂툭ᝑ튅靂퇥\u1759틍띙퀭靗폭ᝉ혅띔큥靋확흉퍥띐톽ᝍ흵㝏튵坑텍\uf75b홅㝁탽㝄틽\uf74e훽흘훕흊통";

      do {
         char var19 = var13.charAt(var17);
         var10001 = var17 + 1;
         int var21 = 0;
         char[] var20 = var13.substring(var10001, var10001 + var19).toCharArray();

         do {
            char var22 = var20[var21];
            if (var21 % 2 == 0) {
               var20[var21] = (char)((var22 >>> 3 | var22 << '\r') & 65535 ^ var18);
            } else {
               var20[var21] = (char)((var22 << 3 | var22 >>> '\r') & 65535 ^ var18);
            }
         } while (++var21 < var20.length);

         var15[var16] = new String(var20);
         var16++;
         var17 = var17 + var19 + 1;
      } while (var17 < var14);

      lI = var15;
      ll = new Object[var15.length];
      int var9 = 339415384;
      byte[] var7 = "Q3¤LZ°!\u008c\u0085(\u0018KW\u0005\u0000\u0011$\u0016'4O\u0016\u0000d\u0016\u0015ÐNVDþ\u0006\u0095Õ\u00908û\u000e\u0080 vø#µÃ<CX\bñ\u009cÔf\u0013t\u0087Z4§öó\u0084wßÅð\n\u008f\u001cÁ*Â\u0099Tq2cÑSìD!W{RL\fC½\u0005@6´±zyOd[C@B Í\u0081Ì*.y\u001dë3ÕÝ&ïP]R¨(®\u0098ÚiÄ¶W\u0085\u0006\u0004w\u0005óaölEI\u0083ÇNB\u0016['3ÿ%i4¬p¾>%ÇÂ\u0092\u0012{Ä6GÚ_\u0006\u009bÎ\u008a\u0015·\u0005\u0087\n`´'\u001dèú-ÁPµ7\u009b'1¯hâ\u001ccaç\u009eÎÃÎÇ\u007f\u008d\u008bÅ\u0098¦c?\u001d\"n¡Ï\u0096¿\u009dÑj²èqÌ(C×\u0011°\u0081m\u0087¹¶\r¹Ê²\f³Ü\u0015°3À|\u0093Î´æ\u001eF¸BgG~ãGi8züa¸¶æxká-È+\t1\u00910[\u0085¬Ò\\Ö5\u0018\u0003¢CÕ±\u009a\u0010&N\u0080²ã\u007fàrD\u0006X´®¼\u001c5»\u0017O U«y\u001f»,¦³\u00ad\fð\u0095¿\u0096²½\u009ds\u009d\u008d¦\u0015Q\u0086Óù`Ë\u00advÊ÷b\u009f\u0094\u0012\r\u0011\u001a\u0005\u000bî\u0098ÿÅ¥\u0087Ï\u0095ÑÞ¨OÚús¯\u0080ÐPÇ1u¸\t\u0016³\u0016WF-¬\u0014\u009e¼¦oñÙyÞ$ÌÀ\u0006§\u00867\u0004\u0088H=\u001d\u009aÈ\u009dé\u0099ùøQn£{-/jAó#\u0016\u0083Éç'Nî\u0013W\u001aT5.õ\f¥-\u0003@\u0090JÂ~ûuþÜb\u0016\u0081Ó\u0083¿Rq¹ó¸V\u0018è×y7\\Ð³\u0091Øù\u0018<41U\u0017ý¦\u0097\u0089gB\u0017lô°Ý¸Ö\u0011\u007fÿoN\u0019RDó(á\f\t\u0017l\u009d´³5H\u0012±\u0097\u000eÇÆ\u0090zB\u009b\"\u0005e-\u008eñëq\u0081Me\u000bH-M|\u0084Öº*ËÇs*\u0018!\u001aúÝë8\u009fç\u001a7`&{µ\u0014£ïGQù\u0010â\u00180â}F¤èN\u0000ðî¿¡¿\u0015\u0081\u008a@øvúøJÐ÷\u0091\u0018±@ÐDåÌ\u008dsJ °*q¾\u0010¾¯>\u0094v\u001cø\u0013sÃÐyJ\u0002s¾LÉå;Éß½Çù\u000em\u0005\u0001Ô;Î\u009aÉ\u0088«F\u007f\u008d^Z[Á/Q¤\u0084$ªI1ìûçzS\u0083\u009fýlÇ.B\u0001óô¤¢ÙÕ\u009e+\u0015\u0004¿\u00054\u0095p¼Ö\u001cÅ\u007fÆþúcnÕJýb\u0088À¯\u0016x\u000fFEbhTTt\u008e\u0010\u0088\u0007¶ð/Øl\u0092ä$%30\u001fM\u0018§gfM¦?\u0084óT\u0094\u0090QaÑ·ý\u0014©aè\u0006ù\f]\u009ceå×©Â\u0000ÇOýÉ\u001f\"Ø^ñ-¸\u0096Lÿ¼·\u00153\u0089P±\u0089`\u0087¾4\rî\u0087\u009c\u007f6Ä[ÄDÆ\u008do¿Å²ðì\u0005]»\u0013Vèqb\u0083c@\u0013LÞýwDp`\u009a/0Ê×åïm¶Ù\u0006óQ\u0017eÅÿ\u0014²×wç\u0002\u008bÏ\fc\u001fmÑg\u0098\u0005\u0014)g\u0091Ú+{¢Oh\u0093\u0085U\u0087ót$\b\u0089\u0098DZ\b\bN\u007fÚSZ\tpiPñ¶ö+\u001d\u008ann¡.\u008d\u0095n²äf\u0081\u001e\u0005Äe\u008e\u000eå\u00004\u0003:@õq\u0000\f\u0013ü%Zª\b¼7c2ÄÂ.\u0095\u008dõ\u0007ðÁ\"\u0085Cò>2\u0080#ughÁf¦CäÍ÷a@ëmàØÄ\u0002«îÅ_ìB¤\u0003³>¡\u001aD\u0082á\u009e¡\b\u0085Èy-Õ´Ä£¶½I\u001b#\u001eõ,-\u0088S\u001e¤\u0087\u001dñ\u0099Æör\u0093aã\u0002\u0011Ì«½Óå,iz\u0014Z6OG²\u000elgãd\u0098\u0087\u0002\b«n÷h\u0093iÅÑ\u0003Ç|=õ\t\u0080\u009déÿæVSÊ\u0092tÅß-\u009dÌ\u0083\u0084'r©>p0øLÂ\u0081\u0080~"
         .getBytes("ISO-8859-1");
      int var8 = var7.length / 4;
      Il = new int[var8];
      byte var10 = 0;
      int var11 = 0;

      do {
         int var12 = (var7[var10] & 255) << 24 | (var7[var10 + 1] & 255) << 16 | (var7[var10 + 2] & 255) << 8 | var7[var10 + 3] & 255;
         var12 ^= var9;
         Il[var11] = var12;
         var10 += 4;
      } while (++var11 < var8);

      String[] var5 = new String[2];
      int var3 = 0;
      String var2;
      int var4 = (var2 = II(1759104658, var23 ^ -579708077)).length();
      int var1 = l(878751859, var23 ^ -420151908);
      int var0 = -1;

      while (true) {
         char[] var10002;
         label73: {
            int var10000 = l(878751858, var23 ^ -310937576);
            char[] var10003 = var2.substring(++var0, var0 + var1).toCharArray();
            int var10004 = var10003.length;
            int var6 = 0;
            int var34 = var10000;
            var10002 = var10003;
            var10001 = var10004;
            char[] var10005;
            int var10006;
            if (var10004 <= 1) {
               var10005 = var10003;
               var10004 = var10000;
               var10006 = var6;
            } else {
               var34 = var10000;
               var10001 = var10004;
               if (var10004 <= var6) {
                  break label73;
               }

               var10005 = var10003;
               var10004 = var10000;
               var10006 = var6;
            }

            while (true) {
               var10005[var10006] = (char)(var10005[var10006] ^ var10004 ^ switch (var6 % l(878751857, var23 ^ 854540772)) {
                  case 0 -> l(878751856, var23 ^ -524133970);
                  case 1 -> l(878751863, var23 ^ -1814987101);
                  case 2 -> l(878751862, var23 ^ -120497731);
                  case 3 -> l(878751861, var23 ^ -1580037753);
                  case 4 -> l(878751860, var23 ^ -511465487);
                  case 5 -> l(878751867, var23 ^ 571656615);
                  default -> l(878751866, var23 ^ 1288296719);
               });
               var6++;
               if (var34 == 0) {
                  var10006 = var34;
                  var10005 = var10002;
                  var10004 = var34;
               } else {
                  if (var10001 <= var6) {
                     break;
                  }

                  var10005 = var10002;
                  var10004 = var34;
                  var10006 = var6;
               }
            }
         }

         String var36 = new String(var10002).intern();
         byte var31 = -1;
         var5[var3++] = var36;
         if ((var0 += var1) >= var4) {
            II = var5;
            I = new String[2];
            return;
         }

         var1 = var2.charAt(var0);
      }
   }

   private static String I(int var0, int var1) {
      int var9 = -773418507;
      int var2 = (var0 ^ l(878751865, var9 ^ -2025498328)) & l(878751864, var9 ^ 847289012);
      if (I[var2] == null) {
         char[] var3 = II[var2].toCharArray();

         int var4 = switch (var3[0] & l(878751871, var9 ^ -112443329)) {
            case 0 -> l(878751870, var9 ^ -1750161363);
            case 1 -> l(878751869, var9 ^ -1417053295);
            case 2 -> l(878751868, var9 ^ 37333210);
            case 3 -> l(878751843, var9 ^ 877516513);
            case 4 -> l(878751842, var9 ^ -310577543);
            case 5 -> l(878751841, var9 ^ 1760144786);
            case 6 -> l(878751840, var9 ^ -1838379200);
            case 7 -> l(878751847, var9 ^ -1248031775);
            case 8 -> l(878751846, var9 ^ -1544433542);
            case 9 -> l(878751845, var9 ^ 1287166976);
            case 10 -> l(878751844, var9 ^ 1158456837);
            case 11 -> l(878751851, var9 ^ -1093040282);
            case 12 -> l(878751850, var9 ^ -1308656541);
            case 13 -> l(878751849, var9 ^ 1886516916);
            case 14 -> l(878751848, var9 ^ -2002765883);
            case 15 -> l(878751855, var9 ^ 610335251);
            case 16 -> l(878751854, var9 ^ -1579119172);
            case 17 -> l(878751853, var9 ^ -653048747);
            case 18 -> l(878751852, var9 ^ -1736873386);
            case 19 -> l(878751827, var9 ^ 1958467724);
            case 20 -> l(878751826, var9 ^ -196166383);
            case 21 -> l(878751825, var9 ^ -1644653117);
            case 22 -> l(878751824, var9 ^ 921935463);
            case 23 -> l(878751831, var9 ^ -1432687404);
            case 24 -> l(878751830, var9 ^ -724244366);
            case 25 -> l(878751829, var9 ^ -2130451874);
            case 26 -> 0;
            case 27 -> l(878751828, var9 ^ 914312859);
            case 28 -> l(878751835, var9 ^ -1971721600);
            case 29 -> l(878751834, var9 ^ 736287439);
            case 30 -> l(878751833, var9 ^ 1060620580);
            case 31 -> l(878751832, var9 ^ -197470704);
            case 32 -> l(878751839, var9 ^ 1167769928);
            case 33 -> l(878751838, var9 ^ 193994147);
            case 34 -> l(878751837, var9 ^ 1149912093);
            case 35 -> l(878751836, var9 ^ -1072515865);
            case 36 -> 1;
            case 37 -> l(878751811, var9 ^ -304169683);
            case 38 -> l(878751810, var9 ^ 1869815610);
            case 39 -> l(878751809, var9 ^ 918704411);
            case 40 -> l(878751808, var9 ^ 874871541);
            case 41 -> l(878751815, var9 ^ -828309827);
            case 42 -> l(878751814, var9 ^ 1349667444);
            case 43 -> l(878751813, var9 ^ 1819063997);
            case 44 -> l(878751812, var9 ^ 432804634);
            case 45 -> l(878751819, var9 ^ -1301623481);
            case 46 -> l(878751818, var9 ^ 1892703227);
            case 47 -> l(878751817, var9 ^ 1202742700);
            case 48 -> l(878751816, var9 ^ 1135701802);
            case 49 -> l(878751823, var9 ^ -468848686);
            case 50 -> l(878751822, var9 ^ -1926360378);
            case 51 -> l(878751821, var9 ^ 396597807);
            case 52 -> l(878751820, var9 ^ -1277519043);
            case 53 -> l(878751795, var9 ^ 318420604);
            case 54 -> l(878751794, var9 ^ -1958626025);
            case 55 -> l(878751793, var9 ^ 1197188277);
            case 56 -> l(878751792, var9 ^ 277877808);
            case 57 -> l(878751799, var9 ^ -125022810);
            case 58 -> l(878751798, var9 ^ -1439140961);
            case 59 -> l(878751797, var9 ^ -1385436597);
            case 60 -> l(878751796, var9 ^ -232808500);
            case 61 -> l(878751803, var9 ^ 1076350014);
            case 62 -> l(878751802, var9 ^ -1086493106);
            case 63 -> l(878751801, var9 ^ -1906463017);
            case 64 -> l(878751800, var9 ^ -135960403);
            case 65 -> l(878751807, var9 ^ 1302456579);
            case 66 -> l(878751806, var9 ^ -420283333);
            case 67 -> l(878751805, var9 ^ 1522844449);
            case 68 -> l(878751804, var9 ^ -585404432);
            case 69 -> l(878751779, var9 ^ -45266534);
            case 70 -> l(878751778, var9 ^ 1729061270);
            case 71 -> l(878751777, var9 ^ -2111811118);
            case 72 -> l(878751776, var9 ^ -454272507);
            case 73 -> l(878751783, var9 ^ 148707172);
            case 74 -> l(878751782, var9 ^ -2022233122);
            case 75 -> l(878751781, var9 ^ 1848233678);
            case 76 -> l(878751780, var9 ^ -525870711);
            case 77 -> l(878751787, var9 ^ 522527689);
            case 78 -> l(878751786, var9 ^ 1413092308);
            case 79 -> l(878751785, var9 ^ 543388676);
            case 80 -> l(878751784, var9 ^ 726118180);
            case 81 -> l(878751791, var9 ^ 1903004832);
            case 82 -> l(878751790, var9 ^ -1060608862);
            case 83 -> l(878751789, var9 ^ -418461426);
            case 84 -> l(878751788, var9 ^ -1215270745);
            case 85 -> l(878751763, var9 ^ 1862367834);
            case 86 -> l(878751762, var9 ^ 6595859);
            case 87 -> l(878751761, var9 ^ -714007519);
            case 88 -> l(878751760, var9 ^ 1446767559);
            case 89 -> l(878751767, var9 ^ 2046157128);
            case 90 -> 2;
            case 91 -> l(878751766, var9 ^ 1802846633);
            case 92 -> l(878751765, var9 ^ 1749296318);
            case 93 -> l(878751764, var9 ^ -1625381040);
            case 94 -> l(878751771, var9 ^ -556294666);
            case 95 -> l(878751770, var9 ^ -760520763);
            case 96 -> l(878751769, var9 ^ 379228759);
            case 97 -> l(878751768, var9 ^ -487930348);
            case 98 -> l(878751775, var9 ^ -996988669);
            case 99 -> l(878751774, var9 ^ 1418780538);
            case 100 -> l(878751773, var9 ^ 1643585178);
            case 101 -> l(878751772, var9 ^ 180888189);
            case 102 -> l(878751747, var9 ^ -1817486029);
            case 103 -> l(878751746, var9 ^ 1912770124);
            case 104 -> l(878751745, var9 ^ 1213096988);
            case 105 -> l(878751744, var9 ^ -380302515);
            case 106 -> l(878751751, var9 ^ -958329734);
            case 107 -> l(878751750, var9 ^ 1617241517);
            case 108 -> l(878751749, var9 ^ -846598846);
            case 109 -> l(878751748, var9 ^ -431981860);
            case 110 -> l(878751755, var9 ^ 2027593301);
            case 111 -> l(878751754, var9 ^ -1656132423);
            case 112 -> l(878751753, var9 ^ 1231801793);
            case 113 -> l(878751752, var9 ^ 248681098);
            case 114 -> l(878751759, var9 ^ -1543950471);
            case 115 -> l(878751758, var9 ^ 280090010);
            case 116 -> l(878751757, var9 ^ -1658820417);
            case 117 -> l(878751756, var9 ^ -990523819);
            case 118 -> l(878751987, var9 ^ 1723014001);
            case 119 -> l(878751986, var9 ^ 1640471834);
            case 120 -> l(878751985, var9 ^ -742868522);
            case 121 -> l(878751984, var9 ^ 2135701304);
            case 122 -> l(878751991, var9 ^ 1894824221);
            case 123 -> l(878751990, var9 ^ -1181707879);
            case 124 -> l(878751989, var9 ^ 1969972761);
            case 125 -> l(878751988, var9 ^ 981118115);
            case 126 -> l(878751995, var9 ^ -375601441);
            case 127 -> l(878751994, var9 ^ 743892076);
            case 128 -> l(878751993, var9 ^ 380103432);
            case 129 -> l(878751992, var9 ^ -674862600);
            case 130 -> l(878751999, var9 ^ 1381145518);
            case 131 -> l(878751998, var9 ^ 145571554);
            case 132 -> l(878751997, var9 ^ -1050697253);
            case 133 -> l(878751996, var9 ^ 1431671355);
            case 134 -> l(878751971, var9 ^ 22242227);
            case 135 -> l(878751970, var9 ^ 1319656920);
            case 136 -> l(878751969, var9 ^ -1320834385);
            case 137 -> l(878751968, var9 ^ 167185488);
            case 138 -> l(878751975, var9 ^ 1621454306);
            case 139 -> l(878751974, var9 ^ 569981213);
            case 140 -> l(878751973, var9 ^ 2093913664);
            case 141 -> l(878751972, var9 ^ 1100459290);
            case 142 -> l(878751979, var9 ^ -519867581);
            case 143 -> l(878751978, var9 ^ 1707851928);
            case 144 -> l(878751977, var9 ^ -489808038);
            case 145 -> l(878751976, var9 ^ -1997021661);
            case 146 -> l(878751983, var9 ^ 1341199816);
            case 147 -> l(878751982, var9 ^ -898366488);
            case 148 -> l(878751981, var9 ^ 910480101);
            case 149 -> l(878751980, var9 ^ -189003725);
            case 150 -> l(878751955, var9 ^ 1059526137);
            case 151 -> l(878751954, var9 ^ 1526440831);
            case 152 -> l(878751953, var9 ^ -1343780932);
            case 153 -> l(878751952, var9 ^ -554927918);
            case 154 -> l(878751959, var9 ^ -719874563);
            case 155 -> l(878751958, var9 ^ 491142139);
            case 156 -> l(878751957, var9 ^ -1572977680);
            case 157 -> l(878751956, var9 ^ -1652886860);
            case 158 -> l(878751963, var9 ^ -263313249);
            case 159 -> l(878751962, var9 ^ 1399064921);
            case 160 -> l(878751961, var9 ^ -626468094);
            case 161 -> l(878751960, var9 ^ -192329375);
            case 162 -> l(878751967, var9 ^ 1298907359);
            case 163 -> l(878751966, var9 ^ -1904532984);
            case 164 -> l(878751965, var9 ^ -1831663339);
            case 165 -> l(878751964, var9 ^ 215962714);
            case 166 -> l(878751939, var9 ^ 1588307190);
            case 167 -> l(878751938, var9 ^ -1208435186);
            case 168 -> l(878751937, var9 ^ -1511413536);
            case 169 -> l(878751936, var9 ^ -516564082);
            case 170 -> l(878751943, var9 ^ 26346538);
            case 171 -> l(878751942, var9 ^ 1666840715);
            case 172 -> l(878751941, var9 ^ -1030896686);
            case 173 -> l(878751940, var9 ^ -384124074);
            case 174 -> l(878751947, var9 ^ -1139022990);
            case 175 -> l(878751946, var9 ^ 48843556);
            case 176 -> l(878751945, var9 ^ -1596191427);
            case 177 -> l(878751944, var9 ^ 212432309);
            case 178 -> l(878751951, var9 ^ 431695542);
            case 179 -> l(878751950, var9 ^ -1407075864);
            case 180 -> l(878751949, var9 ^ 638852818);
            case 181 -> l(878751948, var9 ^ 921838048);
            case 182 -> l(878751923, var9 ^ -291568616);
            case 183 -> l(878751922, var9 ^ 9462952);
            case 184 -> l(878751921, var9 ^ -1119723295);
            case 185 -> l(878751920, var9 ^ -460433996);
            case 186 -> l(878751927, var9 ^ 1077197993);
            case 187 -> l(878751926, var9 ^ 1334432077);
            case 188 -> l(878751925, var9 ^ 1981916014);
            case 189 -> l(878751924, var9 ^ 904271935);
            case 190 -> l(878751931, var9 ^ 925938492);
            case 191 -> l(878751930, var9 ^ 873409727);
            case 192 -> 4;
            case 193 -> l(878751929, var9 ^ -186620095);
            case 194 -> l(878751928, var9 ^ -1487557366);
            case 195 -> l(878751935, var9 ^ 1927191622);
            case 196 -> l(878751934, var9 ^ -1117576517);
            case 197 -> l(878751933, var9 ^ -1244807950);
            case 198 -> 5;
            case 199 -> l(878751932, var9 ^ -561178908);
            case 200 -> l(878751907, var9 ^ 340963759);
            case 201 -> l(878751906, var9 ^ 683356144);
            case 202 -> l(878751905, var9 ^ -422045355);
            case 203 -> l(878751904, var9 ^ -451998770);
            case 204 -> l(878751911, var9 ^ 381638630);
            case 205 -> l(878751910, var9 ^ -35732583);
            case 206 -> 3;
            case 207 -> l(878751909, var9 ^ 551176159);
            case 208 -> l(878751908, var9 ^ -443237438);
            case 209 -> l(878751915, var9 ^ 731293522);
            case 210 -> l(878751914, var9 ^ -1093316652);
            case 211 -> l(878751913, var9 ^ -1539690707);
            case 212 -> l(878751912, var9 ^ -709536344);
            case 213 -> l(878751919, var9 ^ -1243098090);
            case 214 -> l(878751918, var9 ^ -1077803432);
            case 215 -> l(878751917, var9 ^ -1414222784);
            case 216 -> l(878751916, var9 ^ -1588827560);
            case 217 -> l(878751891, var9 ^ -627026348);
            case 218 -> l(878751890, var9 ^ -1625492880);
            case 219 -> l(878751889, var9 ^ 1691578080);
            case 220 -> l(878751888, var9 ^ -1757625768);
            case 221 -> l(878751895, var9 ^ 903369297);
            case 222 -> l(878751894, var9 ^ 347990082);
            case 223 -> l(878751893, var9 ^ -872601336);
            case 224 -> l(878751892, var9 ^ -240005374);
            case 225 -> l(878751899, var9 ^ -723028510);
            case 226 -> l(878751898, var9 ^ 1300938519);
            case 227 -> l(878751897, var9 ^ 897577630);
            case 228 -> l(878751896, var9 ^ 2085149492);
            case 229 -> l(878751903, var9 ^ 815749622);
            case 230 -> l(878751902, var9 ^ 58977871);
            case 231 -> l(878751901, var9 ^ -758596684);
            case 232 -> l(878751900, var9 ^ 819690097);
            case 233 -> l(878751875, var9 ^ 359672750);
            case 234 -> l(878751874, var9 ^ -1319718494);
            case 235 -> l(878751873, var9 ^ 695852647);
            case 236 -> l(878751872, var9 ^ 527990812);
            case 237 -> l(878751879, var9 ^ -1290149942);
            case 238 -> l(878751878, var9 ^ -820197675);
            case 239 -> l(878751877, var9 ^ 1935426303);
            case 240 -> l(878751876, var9 ^ -113765361);
            case 241 -> l(878751883, var9 ^ -597137251);
            case 242 -> l(878751882, var9 ^ 1376477512);
            case 243 -> l(878751881, var9 ^ -358694272);
            case 244 -> l(878751880, var9 ^ -577743760);
            case 245 -> l(878751887, var9 ^ -283550805);
            case 246 -> l(878751886, var9 ^ 2366116);
            case 247 -> l(878751885, var9 ^ -2094088722);
            case 248 -> l(878751884, var9 ^ -206826657);
            case 249 -> l(878752115, var9 ^ 1282291800);
            case 250 -> l(878752114, var9 ^ -1731737190);
            case 251 -> l(878752113, var9 ^ -940401969);
            case 252 -> l(878752112, var9 ^ -3032394);
            case 253 -> l(878752119, var9 ^ -1792714050);
            case 254 -> l(878752118, var9 ^ -115952879);
            default -> l(878752117, var9 ^ -1724992292);
         };
         int var5 = (var1 & l(878752116, var9 ^ 549329564)) - var4;
         if (var5 < 0) {
            var5 += 256;
         }

         int var6 = ((var1 & l(878752123, var9 ^ -867577489)) >>> l(878752122, var9 ^ 1817453217)) - var4;
         if (var6 < 0) {
            var6 += 256;
         }

         for (int var7 = 0; var7 < var3.length; var7++) {
            int var8 = var7 % 2;
            char var10002 = var3[var7];
            if (var8 == 0) {
               var3[var7] = (char)(var10002 ^ var5);
               var5 = ((var5 >>> 3 | var5 << 5) ^ var3[var7]) & l(878752121, var9 ^ -1477568641);
            } else {
               var3[var7] = (char)(var10002 ^ var6);
               var6 = ((var6 >>> 3 | var6 << 5) ^ var3[var7]) & l(878752120, var9 ^ -2055732543);
            }
         }

         I[var2] = new String(var3).intern();
      }

      return I[var2];
   }

   @Override
   public void IlIII() {
      IIIIIllII var1 = IIIIIllII.III();
      IIllllI.Il(class_310.method_1551(), var1 == null ? null : var1.II());
   }

   public lIlIII(lIIIlIlI var1) {
      super(
         IlIIllIII.Ill(I(l(878752127, 621132884 ^ -1735207490), l(878752126, 621132884 ^ 573327145))),
         lllIIlIl.Ill,
         IlIIllIII.Ill(I(l(878752125, 621132884 ^ 1970187895), l(878752124, 621132884 ^ -941666645)))
      );
   }

   public lIlIII() {
      this(null);
   }
}
